Repository: VitoAntonioPagone/kitaly
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: it

source: Catalogue
it: Catalogo

source: Admin
it: Amministrazione

source: Kitaly Archive — Preserving Football Heritage
it: Kitaly Archive — Custodi del Patrimonio Calcistico

source: The Archive
it: L'Archivio

source: Explore our curated collection of iconic football heritage, spanning decades of history and passion.
it: Esplora la nostra collezione curata di cimeli calcistici iconici, che attraversa decenni di storia e passione.

source: Filters
it: Filtri

source: Search...
it: Cerca...

source: All Brands
it: Tutti i Brand

source: League
it: Campionato

source: All Leagues
it: Tutti i Campionati

source: Season
it: Stagione

source: All Seasons
it: Tutte le Stagioni

source: items discovered
it: oggetti trovati

source: Sort by
it: Ordina per

source: Latest Arrival
it: Ultimi Arrivi

source: Timeline
it: Cronologia

source: Nothing matches
it: Nessun risultato

source: Our scouts couldn't find any match for your current selection.
it: I nostri scout non hanno trovato corrispondenze per la tua attuale selezione.

source: Explore All
it: Esplora Tutto

source: Home
it: Inizio

source: National Teams
it: Nazionali

source: Italian Clubs
it: Club Italiani

source: Clubs
it: Club

source: Player Issue
it: Preparata/Indossata

source: Competition
it: Competizione

source: Edition
it: Edizione

source: Tag Size
it: Taglia

source: Primary Color
it: Colore Primario

source: Curator's Notes
it: Note del Curatore

source: Inquire about this piece
it: Richiedi informazioni su questo pezzo

source: Archive Metadata
it: Metadati dell'Archivio

source: Football Heritage
it: Patrimonio Calcistico

source: Soccer Jersey
it: Maglia Calcio
